
## 50MHz FPGA main clock (usually generated by oscillator)
create_clock -name clk50 -period  20.000  [get_ports clk50]

## 50MHz lvds clock
create_clock -name lvdsin_clk -period  20.000 [get_ports lvdsin_clk]

## 60MHz FT232H chip clock (generated by FT232H)
create_clock -name ftdi_clk -period  16.666 [get_ports ftdi_clk]

## The clk for adjusting the pll phase
create_clock -name scanclk -period 10.000 [get_nodes command_processor:inst1|scanclk]

## SPI reset "clock"
create_clock -name spireset [get_nodes command_processor:inst1|spireset_L] -period 20.000

# Derive clks
derive_pll_clocks
derive_clock_uncertainty -add

## Declare that these two clocks are asynchronous
set_clock_groups -asynchronous -group {clk50 *pll1|clk[*]} -group {lvdsin_clk *pll1|clk[*]~1} -group {ftdi_clk} -group {scanclk} -group {spireset}

## Ignores
set_false_path -from [get_registers command_processor:inst1|*] -to [get_registers command_processor:inst1|*_sync*]
set_false_path -from [get_registers fpga_top_ft232h_tx_mass*rptr_grey*] -to [get_registers fpga_top_ft232h_tx_mass*rptr_grey*]
set_false_path -from [get_registers fpga_top_ft232h_tx_mass*wptr_grey*] -to [get_registers fpga_top_ft232h_tx_mass*wptr_grey*]

## IO constraints
set_max_delay -to [get_ports clk*] 10
set_min_delay -to [get_ports clk*] -1
set_max_delay -to [get_ports ftdi_*] 10
set_min_delay -to [get_ports ftdi_*] 0
set_max_delay -from [get_ports ftdi_*] 10
set_min_delay -from [get_ports ftdi_*] 0
set_max_delay -from [get_ports lvds*in*] 6
set_min_delay -from [get_ports lvds*in*] 2
set_max_delay -to [get_ports lvdsout*] 10
set_min_delay -to [get_ports lvdsout*] 0
set_max_delay -to [get_ports led* ] 10
set_min_delay -to [get_ports led* ] -10
set_max_delay -from [get_ports reset ] 10
set_min_delay -from [get_ports reset ] -10

set_input_delay -clock ftdi_clk 0 [get_ports ftdi_clk ]
set_input_delay -clock ftdi_clk 0 [get_ports ftdi_rxf_n ]
set_input_delay -clock ftdi_clk 0 [get_ports ftdi_txe_n ]
set_output_delay -clock ftdi_clk 1 [get_ports ftdi_data* ]
set_output_delay -clock ftdi_clk 1 [get_ports ftdi_oe_n ]
set_output_delay -clock ftdi_clk 1 [get_ports ftdi_rd_n ]
set_output_delay -clock ftdi_clk 1 [get_ports ftdi_wr_n ]

set_min_delay -from [get_ports spimiso* ] 0
set_max_delay -from [get_ports spimiso* ] 10
set_min_delay -to [get_ports spiclk ] 0
set_max_delay -to [get_ports spiclk ] 10
set_min_delay -to [get_ports spics* ] 0
set_max_delay -to [get_ports spics* ] 10
set_min_delay -to [get_ports spimosi ] 0
set_max_delay -to [get_ports spimosi ] 10

set_input_delay -clock clk50 0 [get_ports boardin* ]
set_input_delay -clock clk50 0 [get_ports overrange* ]
set_output_delay -clock clk50 0 [get_ports boardout* ]
set_output_delay -clock clk50 0 [get_ports debugout* ]
